CSI API ETABS v1

# cCaseStaticNonlinearStagedSetHingeUnloading Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetHingeUnloading(
    	string Name,
    	int UnloadType
    )

    Function SetHingeUnloading (
    	Name As String,
    	UnloadType As Integer
    ) As Integer

    Dim instance As cCaseStaticNonlinearStaged
    Dim Name As String
    Dim UnloadType As Integer
    Dim returnValue As Integer

    returnValue = instance.SetHingeUnloading(Name,
    	UnloadType)

    int SetHingeUnloading(
    	String^ Name,
    	int UnloadType
    )

    abstract SetHingeUnloading :
            Name : string *
            UnloadType : int -> int

#### Parameters

Name

    Type: SystemString

UnloadType

    Type: SystemInt32

#### Return Value

Type: Int32

See Also

#### Reference

cCaseStaticNonlinearStaged
Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com